#### FabricationUtils Members

---

|  |
| --- |
| FabricationUtils Class   Methods   See Also |

The  FabricationUtils  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | ExportToPCF | Exports a list of fabrication parts into PCF format. |
| Public method Static member | ValidateConnectivity | Check if two connectors are valid to connect directly without couplings |

# See Also

FabricationUtils Class

Autodesk.Revit.DB.Fabrication Namespace